src/Catalogs/Scan_СтатусыКалькуляций/Scan_СтатусыКалькуляций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scan_СтатусыКалькуляций</name>
  <predefined>
    <items>
      <name>НовыйРасчет</name>
      <description>Новый расчет</description>
    </items>
    <items>
      <name>РасчетАннулирован</name>
      <description>Расчет аннулирован</description>
    </items>
    <items>
      <name>РасчетЗавершен</name>
      <description>Расчет завершен</description>
    </items>
    <items>
      <name>РасчетНаСогласовании</name>
      <description>Расчет на согласовании</description>
    </items>
    <items>
      <name>РасчетУтвержден</name>
      <description>Расчет утвержден</description>
    </items>
  </predefined>
  <attributes>
    <name>ЦветТекста</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦветФона</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Шрифт</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/Scan_СтатусыКалькуляций/Forms/ФормаЭлемента/Module.bsl
// Модуль формы элемента справочника "Статусы калькуляций (scania)"

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Объект.Ссылка.Пустая() Тогда
		ЦветФона   = РеквизитФормыВЗначение("Объект").ЦветФона.Получить();
		ЦветТекста = РеквизитФормыВЗначение("Объект").ЦветТекста.Получить();
		Шрифт      = РеквизитФормыВЗначение("Объект").Шрифт.Получить();
	КонецЕсли;
	Scan_СборСтатистики.Scan_ПриОткрытии("Справочники", РеквизитФормыВЗначение("Объект").Метаданные().Синоним);	

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ЦветФона   = Новый ХранилищеЗначения(ЦветФона);
	ТекущийОбъект.ЦветТекста = Новый ХранилищеЗначения(ЦветТекста);
	ТекущийОбъект.Шрифт      = Новый ХранилищеЗначения(Шрифт);
	// Rarus tenkam 11.04.2022 mantis 18433 +++
	Если Объект.Ссылка.Пустая() Тогда
		Scan_СборСтатистики.Scan_ПередЗаписьюСправочника(РеквизитФормыВЗначение("Объект").Метаданные().Синоним, Истина, "Создание нового элемента");
	КонецЕсли;
	// Rarus tenkam 11.04.2022 mantis 18433 --- 
  
КонецПроцедуры


#КонецОбласти
